TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L2117/driverlib/timb_chain_32timer/timb_chain_32timer.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
//@cliArgs --device "MSPM0L211X" --package "LQFP-64(PM)" --part "Default"
//@v2CliArgs --device "MSPM0L2117" --package "LQFP-64(PM)"
// @cliArgs --board /ti/boards/LP_MSPM0L2117 --rtos nortos

/**
 * Import the modules used in this configuration.
 */
const GPIO    = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1   = GPIO.addInstance();
const TIMERB  = scripting.addModule("/ti/driverlib/TIMERB", {}, false);
const TIMERB1 = TIMERB.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
GPIO1.$name                          = "GPIO_LEDS";
GPIO1.associatedPins[0].$name        = "USER_LED";
GPIO1.associatedPins[0].assignedPin  = "0";
GPIO1.associatedPins[0].assignedPort = "PORTA";

const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL", {}, false);

TIMERB1.$name                            = "TIMERB0";
TIMERB1.enabledInterrupts                = ["CNT1_OVF_EVENT"];
TIMERB1.associatedTimer.create(2);
TIMERB1.associatedTimer[0].$name         = "COUNTER_0";
TIMERB1.associatedTimer[0].startCounter  = true;
TIMERB1.associatedTimer[0].desiredPeriod = "1 ms";
TIMERB1.associatedTimer[1].$name         = "COUNTER_1";
TIMERB1.associatedTimer[1].clockSource   = "CNT0_OVERFLOW";
TIMERB1.associatedTimer[1].userLoadValue = 1000;
TIMERB1.associatedTimer[1].startCounter  = true;
